from math import *
from statistics import *


task_number = input("Введите номер задачи: ")

if int(task_number)==1:
    print("Задача 1: Ввести с клавиатуры натуральное число. Вывести на экран младший разряд числа")
    number = input("Введите натуральное число: ")
    n_number = len(number)
    list_number = (number)
    print("Младший разряд числа ", number, " равен ", list_number[n_number-1])

elif int(task_number)==2:
    print("Задача 2: С клавиатуры вводится двузначное натуральное число. Вывести на экран количество десятков в нем")
    number = input("Введите двузначное число: ")
    
    print("Количество десятков в числе ", number, " равно ", int(number)//10)

elif int(task_number)==3:
    print("Задача 3: Дано целое число n. Выведите следующее за ним четное число. При решении этой задачи нельзя использовать условную конструкцию if и циклы")
    number = input("Введите целое число: ")

    print("Следующее за ", number, " четное число равно ", int(number)+2-int(number)%2)

elif int(task_number)==4:
    print("Задача 4: Написать программу, которая находит среднее арифметическое значение трёх вещественных чисел")
    n1=input("Число 1: \n")
    n2=input("Число 2: \n")
    n3=input("Число 3: \n")
    n_list = (float(n1), float(n2), float(n3))
    print("\nСреднее арифметическое = ", mean(n_list))

elif int(task_number)==5: 
    print("Задача 5: Написать программу, которая находит корень линейного уравнения ax + b = 0")
    a = input("Введите a: ")
    b = input("Введите b: ")
    a = int(a)
    b = int(b)

    if int(a) != 0:
        x = sqrt(abs(-b/a))
        print("x равен ", x)
    else:
        print("Вы пытались поделить на 0")
    
elif int(task_number)==6:
    print("Задача 6: Пользователь вводит число и степень. Программа вычисляет указанную степень этого числа.")
    n = input("Введите число: ")
    p = input("Введите степень: ")
    print("Результат =  ", pow(float(n),int(p)))

elif int(task_number)==7:
    print("Задача 7: Написать программу, которая предлагает пользователю ввести радиус окружности, а затем считает площадь и длину этой окружности.\n Число Pi задавать в программе как вещественную константу.")
    r = input("Введите радиус окружности: ")
    if r<0:
        r = r*(-1)
        input("Наверное, вы имели в виду ", r)
    input("При радиусе окружности равном ", r, " площадь = ", math.pi*pow(float(r),2), "длина окружности = ", 2*math.pi*float(r))

    print("Задача 8: Написать программу, которая предоставляет пользователю возможность ввести с клавиатуры количество рублей и переводит его в доллары и евро.")
    rub = input("Сколько рублей вы хотите конвертировать? ")
    course = input("В какую валюту? e/d")

    print("Задача в работе :)")

elif int(task_number)==8:
    print("")

elif int(task_number)==9:
    print("")

elif int(task_number)==10:
    print("")

elif int(task_number)==11:
    print("")

elif int(task_number)==12:
    print("")

elif int(task_number)==8:
    print("")