from math import *
from statistics import *

cont = 'y'
while cont=='y':
    task_number = input("Введите номер задачи: ")

    if int(task_number)==1:
        print("Задача 1: Ввести с клавиатуры натуральное число. Вывести на экран младший разряд числа")
        number = input("Введите натуральное число: ")
        n_number = len(number)
        list_number = (number)
        print("Младший разряд числа ", number, " равен ", list_number[n_number-1])

    elif int(task_number)==2:
        print("Задача 2: С клавиатуры вводится двузначное натуральное число. Вывести на экран количество десятков в нем")
        number = input("Введите двузначное число: ")
    
        print("Количество десятков в числе ", number, " равно ", int(number)//10)

    elif int(task_number)==3:
        print("Задача 3: Дано целое число n. Выведите следующее за ним четное число. При решении этой задачи нельзя использовать условную конструкцию if и циклы")
        number = input("Введите целое число: ")

        print("Следующее за ", number, " четное число равно ", int(number)+2-int(number)%2)

    elif int(task_number)==4:
        print("Задача 4: Написать программу, которая находит среднее арифметическое значение трёх вещественных чисел")
        n1=input("Число 1: \n")
        n2=input("Число 2: \n")
        n3=input("Число 3: \n")
        n_list = (float(n1), float(n2), float(n3))
        print("\nСреднее арифметическое = ", mean(n_list))

    elif int(task_number)==5: 
        print("Задача 5: Написать программу, которая находит корень линейного уравнения ax + b = 0")
        a = input("Введите a: ")
        b = input("Введите b: ")
        a = int(a)
        b = int(b)

        if int(a) != 0:
            x = sqrt(abs(-b/a))
            print("x равен ", x)
        else:
            print("Вы пытались поделить на 0")
    
    elif int(task_number)==6:
        print("Задача 6: Пользователь вводит число и степень. Программа вычисляет указанную степень этого числа.")
        n = input("Введите число: ")
        p = input("Введите степень: ")
        print("Результат =  ", pow(float(n),int(p)))

    elif int(task_number)==7:
        print("Задача 7: Написать программу, которая предлагает пользователю ввести радиус окружности, а затем считает площадь и длину этой окружности.\n Число Pi задавать в программе как вещественную константу.")
        r = input("Введите радиус окружности: ")
        if float(r)<0:
            r = r*(-1)
            print("Наверное, вы имели в виду ", r)
        print("При радиусе окружности равном ", r, " площадь = ", pi*pow(float(r),2), "длина окружности = ", 2*pi*float(r))



    elif int(task_number)==8:
        print("Задача 8: Написать программу, которая предоставляет пользователю возможность ввести с клавиатуры количество рублей и переводит его в доллары и евро.")
        rub = input("Сколько рублей вы хотите конвертировать? ")
        course = input("В какую валюту? e/d ")
        d=30
        e = 50
        if course == "e":
            print("Евро у нас по ", e, ", ", rub, " рублей будет ", e*float(rub), " евро")
        elif course == "d":
            print("Доллар у нас по ", d, ", ", rub, " рублей будет ", d*float(rub), " долларов")
        print("")

    elif int(task_number)==9:
        print("Задача 9: Написать программу, которая переводит километры в сухопутные и морские мили.")
        km = input("Введите километры: ")
        course = input("В какие мили? s(сухопутные)/m(морские) мили: ")
        s=1.609
        m = 0.54
        if course=="s":
            print("Получается ", s*float(km), " сухопутных миль")
        elif course=="m":
            print("Получается ", m*float(km), " морских миль")
        print("")

    elif int(task_number)==10:
        print("Задача 10: Написать программу, которая находит процент P от суммы S.")
        s = input("Введите сумму: ")
        p = input("Введите процент: ")
        print("Получается ", float(s)*(float(p)/100))
        print("")

    elif int(task_number)==11:
        print("Задача 11: Написать программу для определения диаметра окружности, которую можно получить из отрезка проволоки длиной X.")
        X = input("Введите X: ")
        p = pi
        if int(X)==0:
            print("Ноль? :)")
        elif float(X)<0:
            print("Наверное, вы имели в виду ", float(X)*(-1))
            X = float(X)*(-1)
            print("Диаметр равен ", float(X)/p)
        else:
            print("Диаметр равен ", float(X)/p)
        print("")

    elif int(task_number)==12:
        print("Задача 12: Написать программу, которая переводит указанное количество градусов по Цельсию в градусы по шкале Фаренгейта, Кельвина, Реомюра и Делиля. Затем реализовать переод из градусов по Фаренгейту в градусы по Цельсию.")
        C = input("Введите градусы по Цельсию: ")
        C = float(C)
        print("По Фаренгейту: ", (9/5)*(C+32))
        print("По Кельвину: ", C+273.15)
        print("По Реомюру: ", 1,25*C)
        print("По Делилю: ", C*1.5000-100.00)
        F = input("Введите градусы по Фаренгейту: ")
        F = float(F)
        print("По Цельсию: ", (9/5)*(F-32))
        print("")

    elif int(task_number)==13:
        print("Задача 13: Поменять местами значения переменных a и b, сначала с использованием дополнительной третьей переменной, а затем - без.")
        a = "Study"
        b = "Python"
        print("Порядок a, b:", a, b, sep = ' ')
        c = a
        a = b
        b = c
        print("Через третью переменную. Порядок a, b:", a, b, sep = ' ')
        a = "Study"
        b = "Python"

        ab_list = (a,b)
        print("Без третьей переменной. Порядок a, b:", ab_list[1], ab_list[0], sep = ' ')

    elif int(task_number)==14:
        l=[3,4]
        print(" ", l[1])
    
    cont=input("Повторить выбор задачи? y\n")
